collected-data/gfs-4-rep-results/experiements-1-3/5-failure/tfd/fio-gfs-test-low-seq-write-tfd.txt
Started: 15-04-2022--10-41-51

low-seq-write-/mnt/gfs: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-write-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-write-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=21308: Fri Apr 15 10:42:22 2022
  write: IOPS=26, BW=3437KiB/s (3519kB/s)(89.1MiB/26555msec); 0 zone resets
    slat (nsec): min=32685, max=60622, avg=38040.72, stdev=2475.69
    clat (usec): min=34728, max=64712, avg=37194.82, stdev=4510.05
     lat (usec): min=34770, max=64752, avg=37234.62, stdev=4510.67
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[34866],
     | 30.00th=[34866], 40.00th=[34866], 50.00th=[34866], 60.00th=[35390],
     | 70.00th=[35390], 80.00th=[35390], 90.00th=[46400], 95.00th=[46400],
     | 99.00th=[46400], 99.50th=[49546], 99.90th=[64750], 99.95th=[64750],
     | 99.99th=[64750]
   bw (  KiB/s): min= 2560, max= 3840, per=99.92%, avg=3434.75, stdev=390.24, samples=53
   iops        : min=   20, max=   30, avg=26.83, stdev= 3.05, samples=53
  lat (msec)   : 50=99.72%, 100=0.28%
  cpu          : usr=0.06%, sys=0.05%, ctx=1428, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,713,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3437KiB/s (3519kB/s), 3437KiB/s-3437KiB/s (3519kB/s-3519kB/s), io=89.1MiB (93.5MB), run=26555-26555msec
low-seq-write-/mnt/gfs: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-write-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-write-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=21412: Fri Apr 15 10:46:32 2022
  write: IOPS=26, BW=3410KiB/s (3492kB/s)(89.1MiB/26765msec); 0 zone resets
    slat (usec): min=32, max=6604, avg=46.93, stdev=245.92
    clat (usec): min=34708, max=72205, avg=37479.58, stdev=4984.28
     lat (usec): min=34747, max=72244, avg=37528.27, stdev=5007.25
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[34866],
     | 30.00th=[34866], 40.00th=[34866], 50.00th=[34866], 60.00th=[35390],
     | 70.00th=[35390], 80.00th=[45876], 90.00th=[46400], 95.00th=[46400],
     | 99.00th=[46400], 99.50th=[57410], 99.90th=[71828], 99.95th=[71828],
     | 99.99th=[71828]
   bw (  KiB/s): min= 2560, max= 3847, per=99.86%, avg=3405.77, stdev=415.85, samples=53
   iops        : min=   20, max=   30, avg=26.60, stdev= 3.25, samples=53
  lat (msec)   : 50=99.44%, 100=0.56%
  cpu          : usr=0.08%, sys=0.02%, ctx=1429, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,713,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3410KiB/s (3492kB/s), 3410KiB/s-3410KiB/s (3492kB/s-3492kB/s), io=89.1MiB (93.5MB), run=26765-26765msec
low-seq-write-/mnt/gfs: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
low-seq-write-/mnt/gfs: Laying out IO file (1 file / 100MiB)

low-seq-write-/mnt/gfs: (groupid=0, jobs=1): err= 0: pid=21514: Fri Apr 15 10:50:42 2022
  write: IOPS=26, BW=3441KiB/s (3524kB/s)(89.1MiB/26521msec); 0 zone resets
    slat (nsec): min=32616, max=62298, avg=38191.22, stdev=2420.85
    clat (usec): min=34775, max=49127, avg=37146.88, stdev=4329.95
     lat (usec): min=34816, max=49192, avg=37186.84, stdev=4330.46
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[34866],
     | 30.00th=[34866], 40.00th=[34866], 50.00th=[34866], 60.00th=[35390],
     | 70.00th=[35390], 80.00th=[35390], 90.00th=[46400], 95.00th=[46400],
     | 99.00th=[46400], 99.50th=[46400], 99.90th=[49021], 99.95th=[49021],
     | 99.99th=[49021]
   bw (  KiB/s): min= 2560, max= 3840, per=99.94%, avg=3439.58, stdev=390.48, samples=53
   iops        : min=   20, max=   30, avg=26.87, stdev= 3.05, samples=53
  lat (msec)   : 50=100.00%
  cpu          : usr=0.05%, sys=0.06%, ctx=1428, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,713,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3441KiB/s (3524kB/s), 3441KiB/s-3441KiB/s (3524kB/s-3524kB/s), io=89.1MiB (93.5MB), run=26521-26521msec